<template>
  <div class="ly-content">
    <img src="~@/assets/labixiaoxin.jpg" alt="" />
    <h1>没有人知道的一面</h1>
    <div class="scroll-wrapper" ref="wrapper">
      <div class="scroll-content">
        <div class="scroll-item" v-for="(item, index) in content" :key="index">
          <div
            class="title"
            :style="{
              '--color1': color[index][0],
              '--color2': color[index][1],
            }"
          >
            {{ icons[index][0] }}
            <span>{{ item.title }}</span>
            {{ icons[index][1] }}
          </div>
          <div class="item-content">{{ item.content }}</div>
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";
import BScroll from "better-scroll";
import { Dialog } from "vant";

export default defineComponent({
  data() {
    return {
      bs: null as any,
      color: [
        ["rgb(91,205,167)", "rgb(211,117,117)"],
        ["rgb(91,205,167)", "rgb(103,175,211)"],
        ["rgb(91,205,167)", "rgb(23,110,255)"],
        ["rgb(91,205,167)", "rgb(230,62,49)"],
        ["rgb(91,205,167)", "rgb(249,193,34)"],
        ["rgb(91,205,167)", "rgb(41,155,73)"],
        ["rgb(91,205,167)", "rgb(45,124,238)"],
        ["rgb(91,205,167)", "rgb(255,108,55)"],
        ["rgb(91,205,167)", "rgb(52,67,92)"],
        ["rgb(91,205,167)", "rgb(66,184,131)"],
        ["rgb(91,205,167)", "rgb(232,128,128)"],
        ["rgb(91,205,167)", "rgb(242,201,125)"],
        ["rgb(91,205,167)", "rgb(99,226,183)"],
        ["rgb(91,205,167)", "rgb(112,192,232)"],
        ["rgb(91,205,167)", "rgb(99,226,183)"],
        ["rgb(91,205,167)", "rgb(198,120,184)"],
      ],
      icons: [
        ["😑", "😯"],
        ["🙄", "😐"],
        ["🙄", "😓"],
        ["😞", "😇"],
        ["😇", "😏"],
        ["😑", "😓"],
        ["😵", "😵"],
        ["😏", "😇"],
        ["🐥", "🐣"],
        ["🐔", "🐤"],
        ["💫", "💥"],
        ["💢", "💦"],
        ["💧", "🐠"],
        ["🐟", "🐬"],
        ["🐳", "🐋"],
        ["💘", "💛"],
      ],
      content: [
        {
          title: "说走就走",
          content:
            "现在是12.28号凌晨1.36，心里一直有几个声音在徘徊，没有睡着，所以我打开了备忘录来记录一下。",
        },
        {
          title: "轨迹",
          content:
            "首先为什么会有这么些声音，是因为抖音跟最右推送了不少的感情方面的内容给我，标题真的就是专门为我们的现状定制的一样，就不得不点进评论区看看别人的看法以及想法，让我更加意犹未尽，特别是有一个帖子里面的评论说：“作为女生其实可以有更好的选择 可以选择家庭条件好点的男生 可以以后不用还房贷可以找父母有退休工资，有钱帮忙带小孩的男生 ，说实话 二十几岁不是就爱的不行 谁都行”，确实，现在我心里觉得合适貌似比喜欢更加重要，在二十岁这么好的年纪完全可以找一个工作稳定家境好还是本地的对象，好像也没有必要跟我赌一个不确定的未来，这个不确定的未来指的是什么，是不确定的工作，因为我现在努力的方向并不是公务员这种的稳定工作，而是去公司上班，然后就是不确定的工作地点，感情不管是在哪个阶段，钱都是很重要的，因为专业的限制必须得在大城市才能找到高薪的工作，如果想跟你有未来的话，那大概率就是往广东跑了，只有在那边才能拿到相对较高的工资，可是距离变得更加的遥远，虽然三五年后会回来，可我能隔你最近的距离也还是在长沙，依旧是异地，教师下沉教育，程序员互联网前沿，谈个对象只能存留在手机聊天框里也挺悲观的其实。",
        },
        {
          title: "安静",
          content:
            "咱们认识两年了，在一起也有将近半年，这半年说长不长说短也不短，大多数时候都是开心的时候，但也发生过不少的分歧，好在我每次都能及时认识到自己的问题，你也会给我机会让我慢慢改，说实话，异地恋真的好难，很多时候我其实都挺羡慕吴先生的(丽老师)，他能陪对方过每一个节日，能在她需要的时候及时赶到，能在想念对方的时候想见就见，这都是我所办不到的，只能眼睁睁的望着并羡慕着，身处在异地时间久而久之话题越变越少，能共鸣的时候更是屈指可数，有很多时候我都在想我TM为什么不是娄底的呢！",
        },
        {
          title: "给我一首歌的时间",
          content:
            "再说回关于自己本身吧，在你身边我总是感觉自己方方面面都不够，工资不够，长相不够，情商不够，家境不够等等，这就造成了我现在特别的敏感，只要一有矛盾或者你稍微不想理我的时候，我知道这些情况都很正常，但还是有患得患失的感觉，这种感觉就很容易让我摆烂，不想工作不想学习不想进步，脑海里一片混乱想着各种各种的情景，整个人干什么都是心不在焉的，也就是所谓的的内心戏过多吧，这应该也算没有安全感的一种现象吧，自从上一次你单独跟别人出去吃饭，这件事情就刻在了心里，当有了隔阂之后总是会不经意的乱想，不知道你有没有发现，我们两个人其实耦合度很低，就靠着仅仅是情侣二字维持着，生活没有交集，也没有共同的东西，短时间内看起来好像也没什么不妥，当把时间拉长一点，到了适婚的阶段时，考虑的就更多了，我觉得是否能走得远还是要看在一起生活后才能得出结论，你是老师而我是程序员，仔细一想的话，几乎没有能在一起生活的时间段，除非有个人做妥协，但在什么都还不确定的情况下，谁是又能轻易的做出决定呢，我比较急功近利，喜欢付出就能在短时间看到回报的感觉，就好比我花了七百多买了课学习，到了次年找工作就能立马看见成效，或者是我知道的结果一定是我心里所预想的那样，我才会全力的去付出，但是异地感情不一样，要是能在一个城市倒还好，异地就像是行走在大雾里，完全不知道前面会是什么，考验的就是彼此的信任，但是都没有友情基础何来绝对的信任，假设我跟丽老师在某一件事情上有分歧，我想你也会毫不犹豫的选择相信她，这也不奇怪，她在你心里的权重级是比较高的，毕竟我在你的生活中说实在的并不是一个必要的元素，而且有的时候给我的一种感觉就是emm，离开了我自己能找着更好的，这种感觉一部分原因也是来着丽老师吧，她跟我说过一句话（你不对她好总有人对她好）加重了我患得患失的感觉，生怕自己竹篮打水一场空，长跑几年也有没得结果的，所以我不敢付出全部，然后又想着，为什么自己要把大量的经历放到一件时间久，成本高，有时候还难受的事情上呢，如果把这个精力投入到任何一件事情中，比如学习，工作都会有小成就的吧。",
        },
        {
          title: "彩虹",
          content:
            "有的时候装傻只是不想争论而已，因为可以省去很多麻烦，每一次有争论的时候我都感觉我们已经走到头了，我不敢跟你吵架，不论是谁的对错，因为我知道犟不过你，你的脾气说实话我其实把握不住，所以每次你脾气来了我只能道歉认错，但是有的时间我心里是不舒服的，但也没什么，我这人最大的特点就是能忍，但是也造成了我觉得我自己相比以前越来越没有自信了，以前刚认识你的时候，我才发现我原来可以这么有趣以及幽默，也可以受人欢迎，也有人愿意听我神神叨叨，现在经过两元素的尝试性融合之后，双方心里都有着对方的隔阂，再也回不去从前，以前能看到自己的闪光点，觉得自己也没有那么差劲，现在只会看到自己的缺点，想哪里做错了反省自己，就连说句话都要考虑几秒看看能不能说，打的字你会不会曲解我的意思，完全做不到随心所欲的说话了。",
        },
        {
          title: "我不配",
          content:
            "总感觉自己配不上你，这种情况是没在一起就有了，加上在娄底的那天晚上通话的时候你说过你家里希望你找一个本地的公务员，就更加抬不起头了，更何况你也是老师，就觉得跟公务员简直天造地设୧୨，关于这个问题我也去问过丽老师毕竟旁观者清，她说公务员是很好，她家里也想让她找，然后又说我又不比公务员差，让我有上进心，说真的她当时说完我整个人斗志满满，就干劲一下子来了，也就是这股劲吧，现在月薪才能过万，即便如此，但我仍然觉得远远不够，因为你的家庭本来就不差，一对比其实我也就是个芝麻罢了，但是我自己觉得啊，如果我能一个月收入3-4W那应该差不多了，但步入社会才知道，上班打工想要拿到这个价可以说是白日做梦，只有创业才有可能挣到这个钱，但是我这个年纪这个阅历谈创业这不是让别人笑话嘛，我自己都想笑，丽老师要我做到的是“你只管相信我，坚定不移的选择我，要有男子汉担当”，这些话我感觉就像童话故事里的，前面两句话我说出口真的我自己都觉得是在画饼，做不到跟没有把握的事情怎么可能轻易承诺，最后一句担当二字，我现在是绝对配不上这两个字的，我可能连它真正的含义都不知道，说起来倒是张口就说了，但肩膀都是要磨炼才能挑起担子，而且陪一个人成长也是一件挺痛苦的事情，任重而道远吧",
        },
        {
          title: "超人不会飞",
          content:
            "说实话我自己不想结婚，因为结婚没有好的经济条件就是噩梦的开始，你说过没有钱就不生孩子因为会降低自己的生活质量，我现在觉得没有钱都不配结婚，我原本以为喜欢能够胜任一切，什么钱不钱的在一起开心就行，钱可以慢慢挣，现在我觉着这句话只配在电视剧里头出现，现实还是现实，记得有一次刷最右看到一个帖子还挺有意思，说的是情侣之间最不能聊的话题是什么？点进去呢，第一条评论就是，确实，谈钱伤感情这句话除了对父母不适用之外适用于所有的人，也有好多人感情长跑四五年然后结婚前没谈妥直接崩了，丽老师也跟我说过，搞定你父母是我的职责，但是这个职责我感觉不容易，怎么也得一套房一辆车吧，不是说没有这个钱，是我不想伸手家里，不伸手家里想要在六年挣到这个钱还是很难，万一没挣到呢，那时间就都浪费掉了，所以相亲的存在也算是解决了这一个痛点，以前一直觉得相亲不靠谱，觉着是个正常人怎么可能会结婚都结不了，现在知道了，其实也挺好，条件都摆好了都是透明的状态，白纸找白纸，素描找素描，其实一件事情特别是感情说透了基本也就没什么意思了，相亲结婚后分房睡的人都有，为了完成任务的结婚也挺没意思，别人不知道反正相亲不适用于我，跟一个不喜欢不认识的人一起我还不如不结婚，浪费精力跟财力，有这钱给给父母都不需要担心养老问题了。",
        },
        {
          title: "爱的飞行日记",
          content:
            "其实我发现是我离不开你，我感觉我比你想的要更加依赖你，尤其是翻照片的时候看到你或者我们在一起的某个瞬间图，虽然没有face,但就会很喜欢。",
        },
        {
          title: "开不了口",
          content:
            "再喜欢也比不过适合，主动久了也会累，有时候我觉得自己融入不了你的生活，也不知道是我太拘束了还是干嘛。好像你也没有很喜欢我，只不过是找了个喜欢自己的罢了，至少十个月过去了，除了6.8号那天晚上你说我把你当备胎那一瞬间，我感觉你好像需要我，之后就再也没有这种感觉了，记得之前去娄底找你晚上喊你出来走走，到了商场门口时候有个小女生拉着我买花，但是你说不要，但我好像记得丽老师送你花的时候是很开心的，害，这也只是我的猜测，毕竟当时你也说了不要被这种给绑架，或许是真的这么想吧",
        },
        {
          title: "说好的幸福呢",
          content:
            "其实感觉得到你对我已经没什么兴趣了，给我的感觉就是就算我说分开，你也不会有什么情绪波动，在一起这么久了没有一次你打电话给我的，也有可能是之前对我失望透了吧，但也有可能是第一句话吧",
        },
        {
          title: "我落泪情绪零碎",
          content:
            "生活真的挺没意思的，每天上班下班，一日复一日，日日无终始，也没有什么盼头，别人的二十岁都是活力四射未来可期，我感觉我就像个无情的打工机器，每天都是一个人，也没有什么朋友了，谈个恋爱也是异地恋，唉，叹气都成了一个习惯了，在宿舍晚上睡觉的时候室友说我晚上做梦都在叹气，开始我还不信，后面把录音给我听了，就真的蛮离谱的ˆˆ，有时候都会想活着到底是干嘛",
        },
        {
          title: "听妈妈的话",
          content: "估计这世界上也就爸妈在乎我了，还是好好挣钱吧",
        },
        {
          title: "不能说的秘密",
          content:
            "可能你看到这里会觉得这是个精神有问题的人，或者会想着这人是个SB吧，说一些莫名其妙的话和无法让人理解的思路，一会儿这一会儿那的，我也不否认了，因为我自己都这么觉得。",
        },
        {
          title: "断了的弦",
          content:
            "反正现在心里五味杂陈，什么想法都有，可能上面说的东西都是劝退意图多一点，但我还是坚持，相信你看完后应该会对我以及我们的现状有新的看法，但不管你什么看法，都要跟我说一声૭૭，我并没有想营造什么人设，也不是把自己的自卑写出来让人可怜，我就想听听你真实想法对未来的看法，即便没有想法它也是一种想法",
        },
        {
          title: "明明就",
          content:
            "现在是5.21号凌晨2.36，不知道为什么丽老师居然换男朋友了，当时听到这消息感觉背后吹来一阵凉风，记得之前你好像说过，跟他们在一起吃饭的时候他们俩都想要立马结婚了，现在却是这样，我就在想，当时她跟我说的是要有上进心，坦坦荡荡的努力，我想这肯定也是对小吴的要求吧，说好的一起努力一起进步咋半路放弃了，好吧，管那么多干嘛，只是我有点敏感，感觉你会受到影响，容易联想到我们身上罢了。",
        },
        {
          title: "最长的电影",
          content: "我究竟在害怕什么，我害怕我不会挣钱，我害怕不信任",
        },
      ],
    };
  },
  mounted() {
    this.bs = new BScroll(this.$refs.wrapper as HTMLElement, {
      probeType: 3,
      click: true,
    });
    this.$nextTick(() => {
      this.bs.refresh();
    });
  },
  beforeUnmount() {
    localStorage.token = "";
  },
});
</script>

<style lang="scss" scoped>
.ly-content {
  .scroll-content {
  }
  .scroll-wrapper {
    height: calc(100vh - 158px - 20px - 70px);
    overflow: hidden;
    position: relative;

    .scroll-item {
      .title {
        span {
          font-weight: bold;
          //color: var(--title);
          font-size: 18px;
          background: linear-gradient(to right, var(--color1), var(--color2));
          color: transparent;
          -webkit-background-clip: text;
        }
      }

      .item-content {
        width: 100%;
        text-indent: 2em;
        text-align: justify;
      }
    }
  }

  > img {
    width: 100%;
    height: 158px;
  }

  h1 {
    text-align: center;
  }

  color: #383838;
  font-size: 15px;
  line-height: 30px;
  letter-spacing: 2px;
  word-break: break-word;
  font-family: -apple-system, BlinkMacSystemFont, Segoe UI, Roboto, Oxygen,
    Ubuntu, Cantarell, Open Sans, Helvetica Neue, sans-serif;
  scroll-behavior: smooth;
  background-image: linear-gradient(
      0deg,
      transparent 24%,
      rgba(201, 195, 195, 0.329) 25%,
      hsla(0, 8%, 80.4%, 0.05) 26%,
      transparent 27%,
      transparent 74%,
      hsla(0, 5.2%, 81%, 0.185) 75%,
      rgba(180, 176, 176, 0.05) 76%,
      transparent 77%,
      transparent
    ),
    linear-gradient(
      90deg,
      transparent 24%,
      rgba(204, 196, 196, 0.226) 25%,
      hsla(0, 4%, 66.1%, 0.05) 26%,
      transparent 27%,
      transparent 74%,
      hsla(0, 5.2%, 81%, 0.185) 75%,
      rgba(180, 176, 176, 0.05) 76%,
      transparent 77%,
      transparent
    );
  background-color: #fff;
  background-size: 50px 50px;
  padding: 10px 10px 0 10px;
}
</style>
